Autodesk.Revit.DB.Structure.RebarShapeBendAngle
A bend in a rebar shape has an angular range
specified by one of these values. The angles refer to
the angle swept out by one segment as it is bent
relative to another. That is, an "Obtuse" bend results
in two segments that meet at an angle that is less
than 90 degrees when measured internally. Put another
way, to create an equilateral triangle, you would need
two "Obtuse" bends.

Autodesk.Revit.DB.Structure.RebarShapeBendAngle.Obtuse
The angle is between 90 and 180 degrees.

Autodesk.Revit.DB.Structure.RebarShapeBendAngle.Right
The angle is 90 degrees.

Autodesk.Revit.DB.Structure.RebarShapeBendAngle.Acute
The angle is less than 90 degrees.